Documents/DMS_ЗаявкаНаОтгрузку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>DMS_ЗаявкаНаОтгрузку</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>BIR</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>17</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаОтгрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресОтгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/DMS_АдресаРазгрузкиДилеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>DMS_АдресаРазгрузкиДилеров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДоставки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>BIR</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>idТочка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>SKLAD_CODE</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ГрафикРаботКалендарный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ГрафикРаботКалендарный</Name>
			<Comment>График работ календарный</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидДня</Name>
					<Comment>Вид дня</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидДня</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Банковский</Name>
					<Comment>Банковский</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Продолжительность</Name>
					<Comment>Продолжительность</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидИнтервала</Name>
					<Comment>Вид интервала</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыИнтервалов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Основной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>График</Name>
					<Comment>График</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Comment>Дата</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачалоРабочегоВремени</Name>
					<Comment>Начало рабочего времени</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КонецРабочегоВремени</Name>
					<Comment>Конец рабочего времени</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Смена</Name>
					<Comment>Смена</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Смены</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидДня.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидДня</Name>
			<Comment>Вид дня</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Рабочий</Name>
					<Comment>Рабочий</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предпраздничный</Name>
					<Comment>Предпраздничный</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Праздник</Name>
					<Comment>Праздник</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выходной</Name>
					<Comment>Выходной</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Командировка</Name>
					<Comment>Сотрудник находится в командировке</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/DMS_ЗаявкаНаОтгрузку/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	UTC = УниверсальноеВремя(ТекущаяДата());
	ВремяМск = МестноеВремя(UTC, "GMT+3");

	//Козлов Е.А. Начало 25.10.2016
	//КритическаяДата = НачалоДня(ВремяМск) + 11 * 3600;
	КритическаяДата = НачалоДня(ВремяМск) + 12 * 3600;
	//Козлов Е.А. Конец
	ОтправкаДоКритическойДаты = ?(ВремяМск > КритическаяДата, Ложь, Истина);
	
	Если ОтправкаДоКритическойДаты Тогда
		МинимальнаяДатаОтправки = ДатаБезВыходныхИПраздников(ВремяМск, 2);
	Иначе
		МинимальнаяДатаОтправки = ДатаБезВыходныхИПраздников(ВремяМск, 3);
	КонецЕсли;
		
	Элементы.ДекорацияДата.Заголовок = "";
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если Параметры.Свойство("VIN") Тогда 
			Объект.VIN = Параметры.VIN;
		КонецЕсли;
		Если Параметры.Свойство("BIR") Тогда 
			Объект.BIR = Параметры.BIR;
		КонецЕсли;
	Иначе 
		ТолькоПросмотр = Истина;
	КонецЕсли;
	
	//Козлов Е.А. Начало 25.10.2016
	Если Параметры.Свойство("ОбновлятьТолькоСтроку") Тогда
		ОбновлятьТолькоСтроку = Параметры.ОбновлятьТолькоСтроку;
	КонецЕсли;	
	//Козлов Е.А. Конец
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АдресаРазгрузкиДилеров.Адрес,
	|	АдресаРазгрузкиДилеров.idТочка
	|ИЗ
	|	РегистрСведений.DMS_АдресаРазгрузкиДилеров КАК АдресаРазгрузкиДилеров
	|ГДЕ
	|	АдресаРазгрузкиДилеров.BIR = &BIR";
	
	Запрос.УстановитьПараметр("BIR", Объект.BIR);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	ЭтаФорма.Элементы.АдресОтгрузки.СписокВыбора.Очистить();
	Пока Выборка.Следующий() Цикл
		ЭтаФорма.Элементы.АдресОтгрузки.СписокВыбора.Добавить(Выборка.Адрес);	
		Если Выборка.Количество() = 1 И Не ЗначениеЗаполнено(Объект.АдресОтгрузки) Тогда
			Объект.АдресОтгрузки = Выборка.Адрес;
			АдресОтгрузкиПриИзмененииНаСервере();
		КонецЕсли;		
	КонецЦикла; 	
	
КонецПроцедуры

&НаКлиенте
Процедура АдресОтгрузкиПриИзменении(Элемент)
	АдресОтгрузкиПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура АдресОтгрузкиПриИзмененииНаСервере()
	
	Если Не ЗначениеЗаполнено(Объект.АдресОтгрузки) Тогда
		Объект.ТочкаОтгрузки = Неопределено;
		Объект.АдресОтгрузки = Неопределено;
		Элементы.ДекорацияДата.Заголовок = "";
	Иначе	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	АдресаРазгрузкиДилеров.idТочка
		|ИЗ
		|	РегистрСведений.DMS_АдресаРазгрузкиДилеров КАК АдресаРазгрузкиДилеров
		|ГДЕ
		|	АдресаРазгрузкиДилеров.BIR = &BIR
		|	И АдресаРазгрузкиДилеров.Адрес = &Адрес";
		
		Запрос.УстановитьПараметр("BIR", Объект.BIR);
		Запрос.УстановитьПараметр("Адрес", Объект.АдресОтгрузки);
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			Объект.ТочкаОтгрузки = Выборка.idТочка;
		КонецЕсли;
		УстановитьЗаголовокПодсказкиДаты();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	//Козлов Е.А. Начало 25.10.2016
	Если НЕ ОбновлятьТолькоСтроку Тогда 		
		Оповестить("ОбновитьАвтосклад");
	КонецЕсли; 	
	//Оповестить("ОбновитьАвтосклад");
	//Козлов Е.А. Конец
КонецПроцедуры

&НаСервере
Процедура УстановитьЗаголовокПодсказкиДаты()
	
	Если Не ЗначениеЗаполнено(Объект.АдресОтгрузки) Тогда
		//Козлов Е.А. Начало 19.05.2016
		//МинимальнаяДатаОтправки = Дата(1,1,1);
		//Козлов Е.А. Конец
		Элементы.ДекорацияДата.Заголовок = "";
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	
	//Козлов Е.А. Начало 24.10.2016
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	dbo_AGV_DMSSTOCK_01.VIN,
	//	|	dbo_AGV_DMSSTOCK_01.DATE_MADPREV КАК DATE_MADENGA,
	//	|	dbo_AGV_DMSSTOCK_01.SKLAD,
	//	|	dbo_AGV_DMSSTOCK_01.DATE_MADC
	//	|ИЗ
	//	|	ВнешнийИсточникДанных.Автосклад.Таблица.dbo_AGV_DMSSTOCK_01 КАК dbo_AGV_DMSSTOCK_01
	//	|ГДЕ
	//	|	dbo_AGV_DMSSTOCK_01.VIN = &VIN";
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СостояниеАвтомобилей.VIN,
		|	СостояниеАвтомобилей.DATE_MADENGA,
		|	СостояниеАвтомобилей.SKLAD,
		|	СостояниеАвтомобилей.DATE_MADC
		|ИЗ
		|	РегистрСведений.CRM_СостояниеАвтомобилейПроизводителя_v2 КАК СостояниеАвтомобилей
		|ГДЕ
		|	СостояниеАвтомобилей.VIN = &VIN";

	//Козлов Е.А. Конец
		
	Запрос.УстановитьПараметр("VIN", Объект.VIN);	
	ВыборкаСклад = Запрос.Выполнить().Выбрать();
	ВыборкаСклад.Следующий();
	
	СрокДоставки = 1;
	Если НЕ ЗначениеЗаполнено(ВыборкаСклад.SKLAD) Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	МАКСИМУМ(АдресаРазгрузкиДилеров.СрокДоставки) КАК СрокДоставки
			|ИЗ
			|	РегистрСведений.DMS_АдресаРазгрузкиДилеров КАК АдресаРазгрузкиДилеров
			|ГДЕ
			|	АдресаРазгрузкиДилеров.BIR = &BIR
			|	И АдресаРазгрузкиДилеров.idТочка = &idТочка";
			
		Запрос.УстановитьПараметр("BIR", Объект.BIR);
		Запрос.УстановитьПараметр("idТочка", Объект.ТочкаОтгрузки);
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			СрокДоставки = Выборка.СрокДоставки;
		КонецЕсли;
	Иначе
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	АдресаРазгрузкиДилеров.СрокДоставки КАК СрокДоставки
			|ИЗ
			|	РегистрСведений.DMS_АдресаРазгрузкиДилеров КАК АдресаРазгрузкиДилеров
			|ГДЕ
			|	АдресаРазгрузкиДилеров.BIR = &BIR
			|	И АдресаРазгрузкиДилеров.idТочка = &idТочка
			|	И АдресаРазгрузкиДилеров.SKLAD_CODE = &SKLAD";
			
		Запрос.УстановитьПараметр("BIR", Объект.BIR);
		Запрос.УстановитьПараметр("idТочка", Объект.ТочкаОтгрузки);
		Запрос.УстановитьПараметр("SKLAD", ВыборкаСклад.SKLAD);
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			СрокДоставки = Выборка.СрокДоставки;
		КонецЕсли;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Объект.ДатаОтгрузки) Тогда
		//Козлов Е.А. Начало 19.05.2016
		//МинимальнаяДатаОтправки = ТекущаяДата() + 48*60*60;		
			
		//Элементы.ДекорацияДата.Заголовок = 
		//	"Минимально возможная дата отгрузки дилеру " + Формат(МинимальнаяДатаОтправки, "ДФ=dd.MM.yyyy") + "
		//	|Дата доставки дилеру " + Формат(МинимальнаяДатаОтправки + СрокДоставки*24*60*60, "ДФ=dd.MM.yyyy");
		Элементы.ДекорацияДата.Заголовок = 
			"Минимально возможная дата отгрузки дилеру " + Формат(МинимальнаяДатаОтправки, "ДФ=dd.MM.yyyy") + "
			|Предполагаемая дата доставки " + Формат(ДатаБезВыходныхИПраздников(МинимальнаяДатаОтправки, СрокДоставки), "ДФ=dd.MM.yyyy");
		//Козлов Е.А. Конец
	КонецЕсли;
			
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьДатуИзСтроки(СтрокаДата)
	
	ЧастиСтроки1 = Renault_СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаДата, " ");
	ЧастиСтроки2 = Renault_СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ЧастиСтроки1[0], "/");
	Если ЧастиСтроки2.Количество() < 3 Тогда
		ЧастиСтроки2 = Renault_СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ЧастиСтроки1[0], ".");
	КонецЕсли;
	ДатаВозврат = Дата(ЧастиСтроки2[2], ЧастиСтроки2[1], ЧастиСтроки2[0]);
	
	Возврат ДатаВозврат;
	
КонецФункции

&НаКлиенте
Процедура ДатаОтгрузкиПриИзменении(Элемент)
	
	Если Объект.ДатаОтгрузки < МинимальнаяДатаОтправки Тогда
		Предупреждение("Желаемая дата отгрузки не должна быть меньше минимально возможной. ("+МинимальнаяДатаОтправки+")",, "Установка желаемой даты");	
		Объект.ДатаОтгрузки = ЗначениеРеквизитаОбъекта(Объект.Ссылка, "ДатаОтгрузки");
		Возврат;
	КонецЕсли;
	
	//Козлов Е.А. Начало 19.05.2016
	ТекстПроверки = ПроверитьНаПраздникиВыходные(Объект.ДатаОтгрузки);
	
	Если ЗначениеЗаполнено(ТекстПроверки) Тогда
		Предупреждение(ТекстПроверки,, "Установка желаемой даты");
		
		Объект.ДатаОтгрузки = ЗначениеРеквизитаОбъекта(Объект.Ссылка, "ДатаОтгрузки");
		
		Возврат;
	КонецЕсли;	
	//Козлов Е.А. Конец
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗначениеРеквизитаОбъекта(Ссылка, Реквизит)
	
	//Козлов Е.А. Начало 24.10.2016	
	//Возврат Renault_ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, Реквизит);
	Возврат DMS_ОбщегоНазначенияСервер.ЗначениеРеквизитаОбъекта(Ссылка, Реквизит);
	//Козлов Е.А. Конец
	
КонецФункции

//Козлов Е.А. Начало 19.05.2016
&НаСервереБезКонтекста
Функция ПроверитьНаПраздникиВыходные(ПроверяемаяДата)
	ГрафикРаботы = Справочники.ГрафикиРаботы.ГрафикРаботыКомпании;
	ТекстПроверки = "";

	Если ЗначениеЗаполнено(ГрафикРаботы) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗНАЧЕНИЕ(Перечисление.ВидДня.Выходной) КАК ВидДня
			|ПОМЕСТИТЬ ВидыДнейГР
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЗНАЧЕНИЕ(Перечисление.ВидДня.Праздник)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ПРЕДСТАВЛЕНИЕ(ГрафикРаботКалендарный.ВидДня) КАК ВидДня
			|ИЗ
			|	РегистрСведений.ГрафикРаботКалендарный КАК ГрафикРаботКалендарный
			|ГДЕ
			|	ГрафикРаботКалендарный.График = &ГрафикРаботы
			|	И ГрафикРаботКалендарный.Дата = &ПроверяемаяДата
			|	И ГрафикРаботКалендарный.ВидДня В
			|			(ВЫБРАТЬ
			|				ВидыДнейГР.ВидДня
			|			ИЗ
			|				ВидыДнейГР КАК ВидыДнейГР)"; 
		Запрос.УстановитьПараметр("ПроверяемаяДата", НачалоДня(ПроверяемаяДата));
		Запрос.УстановитьПараметр("ГрафикРаботы", ГрафикРаботы);		
		Результат = Запрос.Выполнить();
		
		Если НЕ Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();
			Выборка.Следующий();
			
			ВидДня = Выборка.ВидДня;
			
			Если ВидДня = "Выходной" Тогда
				ТекстПроверки = "Нельзя указывать выходной день!";
			ИначеЕсли ВидДня = "Праздник" Тогда
				ТекстПроверки = "Нельзя указывать праздничный день!";
			КонецЕсли; 		
		КонецЕсли;
	Иначе
		ТекстПроверки = "Не указан график работы!";
	КонецЕсли;
	
	Возврат ТекстПроверки;
КонецФункции

&НаСервереБезКонтекста
Функция ДатаБезВыходныхИПраздников(НачальнаяДата, КоличествоДней)
	ГрафикРаботы = Справочники.ГрафикиРаботы.ГрафикРаботыКомпании;
	
	Если ЗначениеЗаполнено(ГрафикРаботы) Тогда
		
		ДопУсловие = Строка(КоличествоДней + 1);
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗНАЧЕНИЕ(Перечисление.ВидДня.Рабочий) КАК ВидДня
			|ПОМЕСТИТЬ ВидыДнейГР
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЗНАЧЕНИЕ(Перечисление.ВидДня.Предпраздничный)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ ПЕРВЫЕ " + ДопУсловие + "
			|	ГрафикРаботКалендарный.Дата КАК Дата
			|ПОМЕСТИТЬ ТЗ
			|ИЗ
			|	РегистрСведений.ГрафикРаботКалендарный КАК ГрафикРаботКалендарный
			|ГДЕ
			|	ГрафикРаботКалендарный.График = &ГрафикРаботы
			|	И ГрафикРаботКалендарный.Дата >= &ИзменяемаяДата
			|	И ГрафикРаботКалендарный.ВидДня В
			|			(ВЫБРАТЬ
			|				ВидыДнейГР.ВидДня
			|			ИЗ
			|				ВидыДнейГР КАК ВидыДнейГР)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТЗ.Дата КАК Дата
			|ИЗ
			|	ТЗ КАК ТЗ
			|
			|УПОРЯДОЧИТЬ ПО
			|	Дата УБЫВ";	
		Запрос.УстановитьПараметр("ИзменяемаяДата", НачалоДня(НачальнаяДата));
		Запрос.УстановитьПараметр("ГрафикРаботы", ГрафикРаботы);		
		Результат = Запрос.Выполнить();
		
		Если НЕ Результат.Пустой() Тогда
			Выборка = Результат.Выбрать();			
			Выборка.Следующий();
			
			Возврат Выборка.Дата;
		КонецЕсли;
	Иначе
		Сообщить("Не указан график работ!");
	КонецЕсли; 
	
	Возврат НачальнаяДата + 24 * 3600 * КоличествоДней;
КонецФункции
//Козлов Е.А. Конец
